In [29]:
#Pandas Dataframes

In [30]:
import numpy as np
import pandas as pd

In [31]:
np.random.seed(101)

In [32]:
df = pd.DataFrame(np.random.randn(5,4), ["A","B","C","D","E"],["W","X","Y","Z"]) # data, row, columns

In [33]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [34]:
# grabbing a column

In [35]:
df["W"]

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [36]:
type(df["W"]) # it is a series

pandas.core.series.Series

In [37]:
df[["W","Z"]] # passing a list of multiple columns

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [38]:
# adding a new column

In [39]:
df["new"] = df["W"] + df["Y"] # based on new values

In [40]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [41]:
df.drop("new", axis = 1, inplace=True) # axis =1 to specify columns
# in place removes the column in the df

In [43]:
df.drop("E", axis = 0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [44]:
df # since inplace is not specfied is not permanently deleted!

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
# cheking dataframe size

In [45]:
df.shape # row, columns tuple

(5, 4)

In [46]:
# selecting rows

In [49]:
df.loc["A"] # will select any column or row bawed on name

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [50]:
df.iloc[2] # will select the row or column based on its position

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [51]:
# selecting subsets

In [54]:
df.loc["B","Y"] # value on row B and column Y

-0.8480769834036315

In [56]:
df.loc[["A","B"],["W","Y"]]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077